test/good/branch-duplicate.cfg.dot
digraph "branch-duplicate" {
    node [shape=box];
    subgraph "cluster_test1" {
        label="test1";
        "test1_68" [label="let a: Int = 42"];
        "test1_69" [label="if (a == 42)"];
        "test1_70" [label="a = 43",style=filled,fillcolor="#66A7DB"];
        "test1_71" [label="a = 43",style=filled,fillcolor="#66A7DB"];
        "test1_68" -> "test1_69";
        "test1_69" -> "test1_70";
        "test1_69" -> "test1_71";
    }
    subgraph "cluster_test2" {
        label="test2";
        "test2_72" [label="let a: Int = 42"];
        "test2_73" [label="return a == 42 ? a + 43 : a + 43",style=filled,fillcolor="#66A7DB"];
        "test2_72" -> "test2_73";
    }
    subgraph "cluster_test3" {
        label="test3";
        "test3_74" [label="let a: Int = 42"];
        "test3_75" [label="if (a == 42)"];
        "test3_76" [label="a = 44",style=filled,fillcolor="#66A7DB"];
        "test3_77" [label="a = 43",style=filled,fillcolor="#66A7DB"];
        "test3_74" -> "test3_75";
        "test3_75" -> "test3_76";
        "test3_75" -> "test3_77";
    }
    subgraph "cluster_test4" {
        label="test4";
        "test4_78" [label="let a: Int = 42"];
        "test4_79" [label="return a == 42 ? a + 44 : a + 43",style=filled,fillcolor="#66A7DB"];
        "test4_78" -> "test4_79";
    }
}
