test/good/branch-duplicate.cfg.mmd
graph TD
subgraph test1
    test1_68["let a: Int = 42"]
    test1_69["if (a == 42)"]
    test1_70["a = 43"]:::exitNode
    test1_71["a = 43"]:::exitNode
    test1_68 --> test1_69
    test1_69 --> test1_70
    test1_69 --> test1_71
end
subgraph test2
    test2_72["let a: Int = 42"]
    test2_73["return a == 42 ? a + 43 : a + 43"]:::exitNode
    test2_72 --> test2_73
end
subgraph test3
    test3_74["let a: Int = 42"]
    test3_75["if (a == 42)"]
    test3_76["a = 44"]:::exitNode
    test3_77["a = 43"]:::exitNode
    test3_74 --> test3_75
    test3_75 --> test3_76
    test3_75 --> test3_77
end
subgraph test4
    test4_78["let a: Int = 42"]
    test4_79["return a == 42 ? a + 44 : a + 43"]:::exitNode
    test4_78 --> test4_79
end
